controllers/SiteController.php


            if ($step == 3) {
                // Load From TempStorage
                if ($user->save()) {
                    $address->user_id = $user->id;
                    if ($address->save()) {
---
INSERT INTO `user` (`first_name`, `last_name`, `phone`, `created_at`) VALUES ('asdasd', 'asdasd', '09123123', 1649766037)
INSERT INTO `address` (`city_id`, `street`, `house`, `number`, `zipcode`, `user_id`) VALUES (4, 'asdasd', 'asdasd', '123123', 'asd', 45)

                            $result = json_decode($curlApi->getContent(), true);
                            $paymentDataId = $result['paymentDataId'];
                            $user->payment_data_id = $paymentDataId;
                            $user->save();
---
UPDATE `user` SET `payment_data_id`='535f3d28cc49057f1c6c8accdc219be999a1fe4d3aa32d6c95f17e1c5ba73b46b7c9b3ddd6b785de941160550641ae32', `updated_at`=1649766039 WHERE `id`=45

    public function actionCityList(): array
    {
        Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
        $out = [];
        if (isset($_POST['depdrop_parents'])) {
            $parents = $_POST['depdrop_parents'];
            if ($parents != null) {
                $provinceId = $parents[0];
                $list = City::find()->andWhere(['province_id' => $provinceId])->asArray()->all();
---
SELECT * FROM `city` WHERE `province_id`='2'