views/site/register.php

SELECT * FROM `province`
---
/* @var $user User */
/* @var $address Address */

$provinceList = ArrayHelper::map(Province::find()->all(), 'id', 'name');